app/Controllers/Penjualan.php

    public function delete($id)
    {
        // Soft delete di database utama
        $this->penjualanModel->update($id, ['deleted_at' => date('Y-m-d H:i:s')]);
        // Soft delete di database kedua
        $db2 = \Config\Database::connect('db2');
        $db2->table('sales')->where('id', $id)->update(['deleted_at' => date('Y-m-d H:i:s')]);
---
UPDATE `sales` SET `deleted_at` = '2025-07-29 08:15:42'
WHERE `id` = '9'

    public function index()
    {
        $nomor_nota = 'INV-' . date('Ymd') . '-' . strtoupper(substr(md5(uniqid(rand(), true)), 0, 5));
        $customerModel = new \App\Models\MasterCustomerModel();
        $salesModel = new \App\Models\MasterSalesModel();
        $systemDateLimitsModel = new \App\Models\SystemDateLimitsModel();
        $batas = $systemDateLimitsModel->where('menu', 'penjualan')->orderBy('id', 'desc')->first();
        $batas_tanggal_sistem = $batas['batas_tanggal'] ?? '';
        $mode_batas_tanggal = $batas['mode_batas_tanggal'] ?? 'manual';
        $data = [
            'title' => 'Daftar Penjualan',
            'penjualan' => $this->penjualanModel->findAll(),
            'nomor_nota' => $nomor_nota,
            'customers' => $customerModel->findAll(),
            'sales' => $salesModel->findAll(),
---
SELECT *
FROM `system_date_limits`
WHERE `menu` = 'penjualan'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `mastercustomer`
WHERE `mastercustomer`.`deleted_at` IS NULL
SELECT *
FROM `sales`
WHERE `sales`.`deleted_at` IS NULL
SELECT *
FROM `mastersales`
WHERE `mastersales`.`deleted_at` IS NULL

    public function detail($id)
    {
        $penjualan = $this->penjualanModel->find($id);
        if (!$penjualan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Data penjualan tidak ditemukan.');
        }
        $items = [];
        // Ambil data master barang
        $masterBarangModel = new \App\Models\MasterBarangModel();
        $masterBarang = $masterBarangModel
            ->select('products.*, categories.name as category_name')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.deleted_at', null)
            ->findAll();
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL